Repository: SekouD/pylexique
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: fr_fr

source: Contributing
fr_fr: Contribuer

source: Contributions are welcome, and they are greatly appreciated! Every little bit helps, and credit will always be given.
fr_fr: Les contributions sont les bienvenues, et elles sont grandement appréciées ! Chaque petit geste compte, et le crédit sera toujours accordé.

source: You can contribute in many ways:
fr_fr: Vous pouvez contribuer de plusieurs manières :

source: Types of Contributions
fr_fr: Types de contributions

source: Report Bugs
fr_fr: Signaler des bugs

source: Report bugs at https://github.com/SekouDiaoNlp/pylexique/issues.
fr_fr: Signalez les bugs à https://github.com/SekouDiaoNlp/pylexique/issues.

source: If you are reporting a bug, please include:
fr_fr: Si vous signalez un bug, veuillez inclure :

source: Your operating system name and version.
fr_fr: Le nom et la version de votre système d'exploitation.

source: Any details about your local setup that might be helpful in troubleshooting.
fr_fr: Tout détail sur votre installation locale qui pourrait être utile pour le dépannage.

source: Detailed steps to reproduce the bug.
fr_fr: Les étapes détaillées de la reproduction du bug.

source: Fix Bugs
fr_fr: Corriger des bugs

source: Look through the GitHub issues for bugs. Anything tagged with "bug" and "help wanted" is open to whoever wants to implement it.
fr_fr: Jetez un œil sur la section "issues" sur GitHub pour les bugs. Tout ce qui est étiqueté avec "bug" et "help wanted" est ouvert à quiconque veut l'implémenter.

source: Implement Features
fr_fr: Ajouter des fonctionnalités

source: Look through the GitHub issues for features. Anything tagged with "enhancement" and "help wanted" is open to whoever wants to implement it.
fr_fr: Consultez les "issues" sur GitHub pour trouver des propositions d'ajout ou d'amélioration des fonctionnalités. Tout ce qui est étiqueté "amélioration" et "demande d'aide" est ouvert à tous ceux qui veulent l'implémenter.

source: Write Documentation
fr_fr: Rédiger de la documentation

source: pylexique could always use more documentation, whether as part of the official pylexique docs, in docstrings, or even on the web in blog posts, articles, and such.
fr_fr: pylexique a toujours besoin de plus de documentation, que ce soit dans le cadre de la documentation officielle de pylexique, dans les docstrings, ou même sur le web dans des billets de blog, des articles et autres.

source: Submit Feedback
fr_fr: Soumettre des commentaires

source: The best way to send feedback is to file an issue at https://github.com/SekouDiaoNlp/pylexique/issues.
fr_fr: La meilleure façon d'envoyer des commentaires est d'ouvrir un ticket de support à l'adresse https://github.com/SekouDiaoNlp/pylexique/issues.

source: If you are proposing a feature:
fr_fr: Si vous proposez une fonctionnalité :

source: Explain in detail how it would work.
fr_fr: Expliquez en détail comment cela fonctionnerait.

source: Keep the scope as narrow as possible, to make it easier to implement.
fr_fr: Gardez le champ d'application aussi étroit que possible, pour faciliter la mise en œuvre.

source: Remember that this is a volunteer-driven project, and that contributions are welcome :)
fr_fr: N'oubliez pas que ce projet est mené par des bénévoles et que les contributions sont les bienvenues :)

source: Get Started!
fr_fr: Démarrez !

source: Ready to contribute? Here's how to set up `pylexique` for local development.
fr_fr: Prêt à contribuer ? Voici comment configurer `pylexique` pour le développement local.

source: Fork the `pylexique` repo on GitHub.
fr_fr: Créez un fork du dépôt `pylexique` sur GitHub.

source: Clone your fork locally::
fr_fr: Clonez votre fork localement: :

source: Install your local copy into a virtualenv. Assuming you have virtualenvwrapper installed, this is how you set up your fork for local development::
fr_fr: Installez votre copie locale dans un environnement virtuel. En supposant que vous avez installé virtualenvwrapper, voici comment configurer votre fork pour le développement local: :

source: Create a branch for local development::
fr_fr: Créer une branche pour le développement local : :

source: Now you can make your changes locally.
fr_fr: Vous pouvez maintenant effectuer vos modifications localement.

source: When you're done making changes, check that your changes pass flake8 and the tests, including testing other Python versions with tox::
fr_fr: Lorsque vous avez fini d'effectuer des modifications, vérifiez que vos modifications passent bien flake8 et la suite de tests, notamment en testant d'autres versions de Python avec tox: :

source: To get flake8 and tox, just pip install them into your virtualenv.
fr_fr: Pour obtenir flake8 et tox, il suffit de les installer par pip dans votre virtualenv.

source: Commit your changes and push your branch to GitHub::
fr_fr: Valider vos changements et pousser votre branche sur GitHub: :

source: Submit a pull request through the GitHub website.
fr_fr: Soumettez une "pull request" via le site Web GitHub.

source: Pull Request Guidelines
fr_fr: Directives pour les Pull Requests

source: Before you submit a pull request, check that it meets these guidelines:
fr_fr: Avant de soumettre une pull request, vérifiez qu'elle respecte ces directives :

source: The pull request should include tests.
fr_fr: La pull request doit inclure des tests.

source: If the pull request adds functionality, the docs should be updated. Put your new functionality into a function with a docstring, and add the feature to the list in README.rst.
fr_fr: Si la pull request ajoute une fonctionnalité, la documentation doit être mise à jour. Mettez votre nouvelle fonctionnalité dans une fonction avec une docstring, et ajoutez la fonctionnalité à la liste dans README.rst.

source: The pull request should work for Python 3.6, 3.7, 3.8 3.9 and for PyPy. Check https://github.com/SekouDiaoNlp/pylexique/actions and make sure that the tests pass for all supported Python versions.
fr_fr: La pull request devrait fonctionner pour Python 3.6, 3.7, 3.8 3.9 et pour PyPy. Vérifiez https://github.com/SekouDiaoNlp/pylexique/actions et assurez-vous que les tests passent pour toutes les versions de Python supportées.

source: Tips
fr_fr: Conseils

source: To run a subset of tests::
fr_fr: Pour exécuter un sous-ensemble des tests: :

source: Deploying
fr_fr: Déploiement

source: A reminder for the maintainers on how to deploy. Make sure all your changes are committed (including an entry in HISTORY.rst). Then run::
fr_fr: Un rappel pour les mainteneurs sur la façon de déployer. Assurez-vous que toutes vos modifications sont validées (y compris une entrée dans HISTORY.rst). Ensuite, exécutez : :

source: GitHub Actions will then deploy to PyPI if tests pass.
fr_fr: Les packes générés par les actions GitHub seront ensuite déployées vers PyPI si les tests sont réussis.
