Repository: SekouD/pylexique
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: fr_fr

source: Stable release
fr_fr: Version stable

source: To install pylexique, run this command in your terminal:
fr_fr: Pour installer pylexique, exécutez cette commande dans votre terminal :

source: This is the preferred method to install pylexique, as it will always install the most recent stable release.
fr_fr: C'est la méthode recommandée pour installer pylexique, car elle installera toujours la version stable la plus récente.

source: If you don't have `pip`_ installed, this `Python installation guide`_ can guide you through the process.
fr_fr: Si vous n'avez pas installé `pip`_, ce `guide d'installation de Python`_ peut vous guider dans le processus.

source: You can also install pylexique by using Anaconda_ or Miniconda_ instead of `pip`_ .
fr_fr: Vous pouvez également installer pylexique en utilisant Anaconda_ ou Miniconda_ au lieu de `pip`_ .

source: To install Anaconda_ or Miniconda_, please follow the installation instructions on their respective websites. After having installed Anaconda_ or Miniconda_, run these commands in your terminal:
fr_fr: Pour installer Anaconda_ ou Miniconda_, veuillez suivre les instructions d'installation sur leurs sites web respectifs. Après avoir installé Anaconda_ ou Miniconda_, exécutez ces commandes dans votre terminal :

source: If you already have Anaconda_ or Miniconda_ available on your system, just type this in your terminal:
fr_fr: Si vous avez déjà Anaconda_ ou Miniconda_ disponible sur votre système, tapez simplement ceci dans votre terminal :

source: If you intend to install pylexique on a Apple Macbook with an Apple M1 processor, it is advised that you install pylexique by using the conda installation method as all dependencies will be pre-compiled.
fr_fr: Si vous avez l'intention d'installer pylexique sur un Apple Macbook avec un processeur Apple M1, il est conseillé d'installer pylexique en utilisant la méthode d'installation conda car toutes les dépendances seront précompilées.

source: From sources
fr_fr: Depuis le code source

source: The sources for pylexique can be downloaded from the `Github repo`_.
fr_fr: Le code source de pylexique peut être téléchargé depuis le `dépôt Github`_.

source: You can either clone the public repository:
fr_fr: Vous pouvez soit cloner le dépôt public :

source: Or download the `tarball`_:
fr_fr: Ou téléchargez le fichier `tarball`_ :

source: Once you have a copy of the source, you can install it with:
fr_fr: Une fois que vous avez une copie du code source, vous pouvez l'installer avec :
