Repository: SekouD/pylexique
Catalog: docs/locale/*/LC_MESSAGES/modules.po
Languages: fr_fr

source: Package Api Documentation for pylexique
fr_fr: Documentation de l'Api de pylexique

source: API Reference for the classes in pylexique.pylexique.py
fr_fr: Référence de l'API pour les classes de pylexique.pylexique.py

source: Main module of pylexique.
fr_fr: Module principal de pylexique.

source: This is the class handling the lexique database. It provides methods for interacting with the Lexique DB and retrieve lexical items. All the lexical items are then stored in an Ordered Dict.
fr_fr: C'est la classe qui gère la base de données lexicale. Elle fournit des méthodes pour interagir avec la base de données lexicale et récupérer les éléments lexicaux. Tous les éléments lexicaux sont ensuite stockés dans un Dict ordonné.

source: Parameters
fr_fr: Paramètres

source: string. Path to the lexique file.
fr_fr: string. Chemin vers le fichier lexique.

source: string. 'pandas_csv' and 'csv' are valid values. 'csv' is the default value.
fr_fr: string. "pandas_csv " et " csv " sont des valeurs valides. La valeur par défaut est "csv".

source: Dictionary containing all the LexicalItem objects indexed by orthography.
fr_fr: Dictionnaire contenant tous les objets LexicalItem indexés par orthographe.

source: Dictionary containing all the LexicalItem objects indexed by lemma.
fr_fr: Dictionnaire contenant tous les objets LexicalItem indexés par lemme.

source: Dictionary containing all the LexicalItem objects indexed by anagram form.
fr_fr: Dictionnaire contenant tous les objets LexicalItem indexés par forme d'anagramme.

source: Returns
fr_fr: Renvoie

source: generator of rows: Content of the Lexique38x database.
fr_fr: générateur de lignes : Contenu de la base de données Lexique38x.

source: Parses the given lexique file and creates 2 hash tables to store the data.
fr_fr: Analyse le fichier lexique donné et crée 2 tables de hachage pour stocker les données.

source: string. Can be either 'csv', 'pandas_csv'.
fr_fr: string. Peut être 'csv' ou 'pandas_csv'.

source: Creates 2 hash tables populated with the entries in lexique if it does not exist yet.
fr_fr: Crée 2 tables de hachage remplies avec les entrées de lexique si celui-ci n'existe pas encore.

source: One hash table holds the LexItems, the other holds the same data but grouped by lemmma to give access to all lexical forms of a word.
fr_fr: Une table de hachage contient les LexItems, l'autre contient les mêmes données mais regroupées par lemme pour donner accès à toutes les formes lexicales d'un mot.

source: Iterable. Iterable containing the lexique383 entries.
fr_fr: Iterable. Iterable contenant les entrées du lexique383.

source: Convert entries from `strings` to `int`, `bool` or `float` and generates
fr_fr: Convertit les entrées de `strings` en `int`, `bool` ou `float` et génère

source: a new list with typed entries.
fr_fr: une nouvelle liste avec des entrées typées.

source: List of column entries representing a row.
fr_fr: Liste d'entrées de colonnes représentant une ligne.

source: ConvertedRow: List of typed column entries representing a typed row.
fr_fr: ConvertedRow : Liste d'entrées de colonnes typées représentant une ligne typée.

source: Recovers the lexical entries for the words in the sequence
fr_fr: Récupère les entrées lexicales pour les mots de la séquence

source: A string or a tuple of multiple strings for getting the LexItems for multiple words.
fr_fr: Une chaîne de caractères ou un tuple de plusieurs chaînes de caractères pour obtenir les LexItems de plusieurs mots.

source: Dictionary of LexItems.
fr_fr: Dictionnaire de LexItems.

source: Gets all lexical forms of a given word.
fr_fr: Récupère toutes les formes lexicales d'un mot donné.

source: List of LexItem objects sharing the same root lemma.
fr_fr: Liste d'objets LexItem partageant le même lemme racine.

source: List of LexItem objects which are anagrams of the given word.
fr_fr: Liste des objets LexItem qui sont des anagrammes du mot donné.

source: Saves the mismatched key/values in Lexique383 based on type coercion.
fr_fr: Sauvegarde les clés/valeurs non concordantes dans Lexique383 en se basant sur la coercition de type.

source: List of errors encountered while parsing Lexique38x
fr_fr: Liste des erreurs rencontrées lors de l'analyse du Lexique38x

source: Path to save the errors.
fr_fr: Chemin pour sauvegarder les erreurs.

source: This class defines the lexical items in Lexique383.
fr_fr: Cette classe définit les éléments lexicaux dans Lexique383.

source: It uses slots for memory efficiency.
fr_fr: Elle utilise les 'slots' pour optimiser l'utilisation de la mémoire.

source: Converts the LexItem to a dict containing its attributes and their values
fr_fr: Convertit le LexItem en un dict contenant ses attributs et leurs valeurs

source: OrderedDict. Dictionary with key/values correspondence wit LexItem objects.
fr_fr: OrderedDict. Dictionnaire avec correspondance clé/valeur avec les objets LexItem.

source: Type information about all the lexical attributes in a LexItem object.
fr_fr: Informations sur le type de tous les attributs lexicaux d'un objet LexItem.

source: API Reference for the classes in pylexique.utils.py
fr_fr: Référence d'API pour les classes dans pylexique.utils.py
