Repository: SekouD/pylexique
Catalog: docs/locale/*/LC_MESSAGES/readme.po
Languages: fr_fr

source: Pylexique is a Python wrapper around Lexique383_.
fr_fr: Pylexique est une librairie Python encapsulant Lexique383_.

source: It allows the extraction of lexical information from more than 140 000 French words in an Object Oriented way.
fr_fr: Elle permet l'extraction d'informations lexicales de plus de 140 000 mots français de manière orientée objet.

source: Free software: MIT license
fr_fr: Logiciel libre : licence MIT

source: PyLexique Documentation: https://pylexique.readthedocs.io (en) -- https://pylexique.readthedocs.io/fr/ (fr)
fr_fr: Documentation de PyLexique: https://pylexique.readthedocs.io (en) -- https://pylexique.readthedocs.io/fr/ (fr)

source: Each lexical item is represented as a LexItem having the following LexEntryType:
fr_fr: Chaque élément lexical est représenté par un LexItem ayant le LexEntryType suivant :

source: The meanings of the attributes of this object are as follow:
fr_fr: Les significations des attributs de cet objet sont les suivantes :

source: ortho: the word
fr_fr: ortho : le mot

source: phon: the phonological forms of the word
fr_fr: phon : les formes phonologiques du mot

source: lemme: the lemmas of this word
fr_fr: lemme : les lemmes de ce mot

source: cgram: the grammatical categories of this word
fr_fr: cgram : les catégories grammaticales de ce mot

source: genre: the gender
fr_fr: genre : le genre

source: nombre: the number
fr_fr: nombre : le nombre

source: freqlemfilms: the frequency of the lemma according to the corpus of subtitles (per million occurrences)
fr_fr: freqlemfilms : la fréquence du lemme selon le corpus de sous-titres (par million d'occurrences)

source: freqlemlivres: the frequency of the lemma according to the body of books (per million occurrences)
fr_fr: freqlemlivres : la fréquence du lemme selon le corpus de livres (par million d'occurrences)

source: freqfilms: the frequency of the word according to the corpus of subtitles (per million occurrences)
fr_fr: freqfilms : la fréquence du mot selon le corpus de sous-titres (par million d'occurrences)

source: freqlivres: the frequency of the word according to the body of books (per million occurrences)
fr_fr: freqlivres : la fréquence du mot selon le corpus de livres (par million d'occurrences)

source: infover: modes, tenses, and possible people for verbs
fr_fr: infover : modes, temps et personnes possibles pour les verbes

source: nbhomogr: number of homographs
fr_fr: nbhomogr : nombre d'homographes

source: nbhomoph: number of homophones
fr_fr: nbhomoph : nombre d'homophones

source: islem: indicates if it is a lemma or not
fr_fr: islem : indique si c'est un lemme ou non

source: nblettres: the number of letters
fr_fr: nblettres : le nombre de lettres

source: nbphons: number of phonemes
fr_fr: nbphons : nombre de phonèmes

source: cvcv: the orthographic structure
fr_fr: cvcv : la structure orthographique

source: p-cvcv: the phonological structure
fr_fr: p-cvcv : la structure phonologique

source: voisorth: number of orthographic neighbors
fr_fr: voisorth : nombre de voisins orthographiques

source: voisphon: number of phonological neighbors
fr_fr: voisphon : nombre de voisins phonologiques

source: puorth: point of spelling uniqueness
fr_fr: puorth : point d'unicité orthographique

source: puphon: point of phonological uniqueness
fr_fr: puphon : point d'unicité phonologique

source: syll: syllable phonological form
fr_fr: syllabe : forme phonologique des syllabes

source: nbsyll: number of syllables
fr_fr: nbsyll : nombre de syllabes

source: cv-cv: syllable phonological structure
fr_fr: cv-cv : structure phonologique des syllabes

source: orthrenv: reverse orthographic form
fr_fr: orthrenv : forme orthographique inversée

source: phonrenv: reversed phonological form
fr_fr: phonrenv : forme phonologique inversée

source: orthosyll: syllable orthographic form
fr_fr: orthosyll : forme orthographique des syllabes

source: cgramortho: the different grammatical category for a given orthographic representation
fr_fr: cgramortho : les différentes catégories grammaticales pour une représentation orthographique donnée

source: deflem: the percentage of people who said they knew the lemma of the word
fr_fr: deflem : le pourcentage de personnes qui ont déclaré connaître le lemme du mot.

source: defobs: the size of the sample from which 'deflem' is derived
fr_fr: defobs : la taille de l'échantillon d'où est tiré 'deflem'.

source: old20: orthographic Levenshtein Distance
fr_fr: old20 : distance de Levenshtein orthographique

source: pld20: phonological Levenshtein Distance
fr_fr: pld20 : distance de Levenshtein phonologique

source: morphoder: inflectional morphology
fr_fr: morphoder : morphologie flexionnelle

source: nbmorph: the number of morphemes directly computed from 'morphoder'
fr_fr: nbmorph : le nombre de morphèmes directement calculé à partir de 'morphoder'.

source: You can find all the relevant information in the `official documentation of Lexique383`_ (French).
fr_fr: Vous pouvez trouver toutes les informations pertinentes dans la `documentation officielle de Lexique383`_ (français).

source: Features
fr_fr: Caractéristiques

source: Extract all lexical information from a French word such as:
fr_fr: Extraire toutes les informations lexicales d'un mot français telles que :

source: orthographic and phonemics representations
fr_fr: les représentations orthographiques et phonémiques

source: associated lemmas
fr_fr: les lemmes associés

source: grammatical category
fr_fr: la catégorie grammaticale

source: gender and number
fr_fr: le genre et le nombre

source: frequencies in a corpus of books and in a body of film subtitles, etc...
fr_fr: les fréquences d'apparition dans un corpus de livres et dans un corpus de sous-titres de films, etc...

source: Extract all the lexical forms of a French word.
fr_fr: Extraire toutes les formes lexicales d'un mot français.

source: Easy to use Api.
fr_fr: Api simple d'utilisation.

source: Easily integrate pylexique in your own projects as an imported library.
fr_fr: Intégrez facilement pylexique dans vos propres projets en tant que bibliothèque importée.

source: Can be used as a command line tool.
fr_fr: Peut être utilisé comme un outil de ligne de commande.

source: Credits
fr_fr: Crédits

source: Main developer SekouDiaoNlp_.
fr_fr: Développeur principal SekouDiaoNlp_.

source: Lexical corpus: Lexique383_
fr_fr: Corpus lexical : Lexique383_

source: About Lexique383
fr_fr: À propos de Lexique383

source: Lexique 3.83 is a French lexical database that provides for ~ 140,000 words of French: orthographic and phonemics representations, associated lemmas, syllabation, grammatical category, gender and number, frequencies in a corpus of books and in a body of film subtitles, etc...
fr_fr: Lexique 3.83 est une base de données lexicale française qui fournit pour ~ 140 000 mots du français : représentations orthographique et phonémique, lemmes associés, syllabation, catégorie grammaticale, genre et nombre, fréquences dans un corpus de livres et dans un corpus de sous-titres de films, etc...

source: Table: `Lexique383.zip`_
fr_fr: Données tabulaires: `Lexique383.zip`_

source: Web site: http://www.lexique.org
fr_fr: Site web : http://www.lexique.org

source: Contributors
fr_fr: Contributeurs

source: and many others... (contact us to be listed)
fr_fr: et bien d'autres encore... (contactez-nous pour être listé)

source: License
fr_fr: Licence

source: BibTex Entry to cite publications about Lexique383:
fr_fr: Entrée BibTex pour citer les publications sur Lexique383 :

source: If you want to cite pylexique in an academic publication use this citation format:
fr_fr: Si vous souhaitez citer pylexique dans une publication universitaire, utilisez ce format de citation :
