Repository: SekouD/pylexique
Catalog: docs/locale/*/LC_MESSAGES/usage.po
Languages: fr_fr

source: Usage
fr_fr: Guide d'utilisation

source: The language of the lexical entries is French. The Lexical Corpus is based on `Lexique383`_. Also note that pylexique only works on Python 3.X.
fr_fr: La langue des entrées lexicales est le français. Le corpus lexical est basé sur `Lexique383`_. Notez également que pylexique ne fonctionne que sur Python 3.X.

source: To use pylexique from the command line:
fr_fr: Pour utiliser pylexique à partir de la ligne de commande :

source: The output will be a json representation of the LexItem objects:
fr_fr: Le résultat sera une représentation json des objets LexItem :

source: You can also provide multiple words and/or specify an output file to save the lexical information in a json file.
fr_fr: Vous pouvez également fournir plusieurs mots et/ou spécifier un fichier de sortie pour enregistrer les informations lexicales dans un fichier json.

source: The output will be similar as previously, with a json entry for each word in the sequence.
fr_fr: Le résultat sera similaire au précédent, avec une entrée json pour chaque mot de la séquence.

source: You can also retrieve all the lexical forms of the provided word/words by using the option '-a' or '--all_forms'
fr_fr: Vous pouvez également récupérer toutes les formes lexicales du ou des mots fournis en utilisant l'option '-a' ou '--all_forms'.

source: To use pylexique as a library in your own projects:
fr_fr: Pour utiliser pylexique comme une bibliothèque dans vos propres projets :

source: There are 2 ways to access the lexical information of a word: Either use the utility method Lexique383.get_lex(item) Or you can directly access the lexicon directory through LEXIQUE.lexique[item] .
fr_fr: Il y a 2 façons d'accéder à l'information lexicale d'un mot : Soit vous utilisez la méthode Lexique383.get_lex(item) Soit vous accédez directement au répertoire du lexique par LEXIQUE.lexique[item] .

source: Notice that item can be either a string or a sequence of strings when using Lexique383.get_lex(item) .
fr_fr: Notez que item peut être soit une chaîne de caractères, soit une séquence de chaînes de caractères lorsque vous utilisez Lexique383.get_lex(item) .

source: Because in French the world 'a' is a very polysemic word, it has several entries in Lexique 383. For this reason the LEXIQUE Dict has the value of the `ortho` property of its LexicalEntry. In th case of 'abaissait' there is only one LexicalItem corresponding to this dict key. But in the case of 'a' there are several LexItem objects corresponding to this key and then the LexItem objects are stored in a list corresponding to th value of the key.
fr_fr: Comme en français le mot 'a' est un mot très polysémique, il a plusieurs entrées dans le Lexique 383. Pour cette raison, le Dict LEXIQUE a pour clés la valeur de la propriété `ortho` de son entrée lexicale. Dans le cas de 'abaissait', il n'y a qu'un seul élément lexical correspondant à cette clé de dictionnaire. Mais dans le cas de 'a', il y a plusieurs objets LexItem correspondant à cette clé et les objets LexItem sont stockés dans une liste correspondant à la valeur de la clé.

source: You can get all the anagrams of a given word by using the get_anagrams() method.
fr_fr: Vous pouvez obtenir tous les anagrammes d'un mot donné en utilisant la méthode get_anagrams().

source: You can get all the forms of a given word by calling the method Lexique383.get_all_forms(word):
fr_fr: Vous pouvez obtenir toutes les formes d'un mot donné en appelant la méthode Lexique383.get_all_forms(word) :

source: You can use the method LexItem.to_dict() to produce a dictionary with key/value pairs corresponding to the LexItem
fr_fr: Vous pouvez utiliser la méthode LexItem.to_dict() pour produire un dictionnaire avec des paires clé/valeur correspondant au LexItem

source: Documentation for _`Lexique383`: http://www.lexique.org
fr_fr: Documentation pour _`Lexicon383` : http://www.lexique.org
